# Operations

In [1]:
import numpy as np
import pandas as pd

In [2]:
Scl_data = {
    'School Name' : ['ABC School', 'DEF School', 'MNO School', 'PQR School','XYZ School'],
    'Rank' : [1,4,2,3,5],
    'Fees' : [1000, 2000,1300, 2100,610],
    'City' : ['Delhi','Noida', 'Meerut','Bengluru','aizwal']
}

In [4]:
DF = pd.DataFrame(Scl_data)

In [5]:
DF

  School Name  Rank  Fees      City
0  ABC School     1  1000     Delhi
1  DEF School     4  2000     Noida
2  MNO School     2  1300    Meerut
3  PQR School     3  2100  Bengluru
4  XYZ School     5   610    aizwal

In [6]:
DF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   School Name  5 non-null      object
 1   Rank         5 non-null      int64
 2   Fees         5 non-null      int64
 3   City         5 non-null      object
dtypes: int64(2), object(2)
memory usage: 288.0+ bytes

In [7]:
DF.describe()

           Rank         Fees
count  5.000000     5.000000
mean   3.000000  1402.000000
std    1.581139   641.108415
min    1.000000   610.000000
25%    2.000000  1000.000000
50%    3.000000  1300.000000
75%    4.000000  2000.000000
max    5.000000  2100.000000

In [9]:
DF.shape

(5, 4)

In [10]:
DF.ndim

2

In [11]:
DF.columns

Index(['School Name', 'Rank', 'Fees', 'City'], dtype='object')

In [12]:
DF.index

RangeIndex(start=0, stop=5, step=1)

In [13]:
DF["Rank"]+100

0    101
1    104
2    102
3    103
4    105
Name: Rank, dtype: int64

In [14]:
DF["Rank"]*100

0    100
1    400
2    200
3    300
4    500
Name: Rank, dtype: int64

In [15]:
DF

  School Name  Rank  Fees      City
0  ABC School     1  1000     Delhi
1  DEF School     4  2000     Noida
2  MNO School     2  1300    Meerut
3  PQR School     3  2100  Bengluru
4  XYZ School     5   610    aizwal

# #Some special operatons

In [19]:
df1 = pd.DataFrame({
    'a' : [1,3,4,2,1,2],
    'b' : [3,2,42,23,2,1],
    'c' : [4,2,3,11,3,0],
    'd' : [2,4,1,3,1,2]
})

In [20]:
def square(x):
    return x**2

In [21]:
#Creating a new column e [which will be the square values of B]

In [24]:
df1['e'] = df1["b"].apply(square)

In [25]:
df1

   a   b   c  d     e
0  1   3   4  2     9
1  3   2   2  4     4
2  4  42   3  1  1764
3  2  23  11  3   529
4  1   2   3  1     4
5  2   1   0  2     1

In [26]:
# We can use lambda also to find the square

In [27]:
df1['a'] = df1['a'].apply(lambda x: x** 2)

In [28]:
df1

    a   b   c  d     e
0   1   3   4  2     9
1   9   2   2  4     4
2  16  42   3  1  1764
3   4  23  11  3   529
4   1   2   3  1     4
5   4   1   0  2     1

In [ ]:
Completed